app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = current_user
    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)