app/controllers/home_controller.rb

SELECT "articles".* FROM "articles"  ORDER BY "articles"."created_at" DESC
---
  def index
    @articles = Article.order(created_at: :desc)