app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    @profile.user = current_user
    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("username", "website", "bio", "profile_pic", "user_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "slug" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["slug", "pedro"], ["updated_at", "2016-05-10 10:01:27.888759"], ["id", 1]]

    def set_profile
      @profile = Profile.friendly.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]